// © Copyright 2004-2012, 2015 HP Development Company, L.P.

HSDTaskName = "Job Storage Settings";

HSDAllowStoredJobsCheckBox = "Allow Stored Jobs on this printer";
HSDInternalPrinterMemoryLocation = "Internal Printer Memory";
HSDUSBFlashStorageDeviceLocation = "USB Flash Storage Device";
InternalPrinterMemoryLocationTooltip = "All Job Storage data on the USB flash storage device will be deleted using the Secure Cryptographic Erase method. All subsequent Stored Jobs will be saved in the printer's internal memory.";
USBFlashStorageDeviceLocationTooltip = "The inserted flash storage device will be formatted and all data will be lost. Existing Job Storage data will then be moved from the printer's internal memory to the flash storage device and deleted from the printer's memory. All subsequent Stored Jobs will be saved on the flash storage device.";

HSDSortPopUpTitle = "Sort Stored Jobs by:";
HSDRetainTempJobsPolicyPopUpTitle = "Retain Temporary Jobs After Reboot:";
HSDDeleteTempJobsAfterPopUpTitle = "Delete Temporary Jobs After:";
HSDDeleteStandardJobsAfterPopUpTitle = "Delete Standard Jobs After:";
HSDRejectNoPinJobsCheckBox = "Cancel All Stored Jobs Without PIN";
HSDDeleteAllStoredJobsButton = "Delete All Stored Jobs";

// values for sort popup
HSDAlphabetically = "Job Name";
HSDChronologically = "Date";

// values for retain temp jobs policy popup
HSDAll = "All";
HSDNone = "Do not retain";
HSDOnlyPersonal = "Only Personal";

// values for delete temp/standard job after popup
HSDNever = "Never";
HSDThirtyMinutes = "30 minutes";
HSDOneHour = "1 hour";
HSDFourHours = "4 hours";
HSDOneDay = "1 day";
HSDOneWeek = "1 week";
HSDFourWeeks = "4 weeks";

NoGetTitle = "Could not retrieve settings";
NoGetMsg = "Check if the printer is online and connected.";
